public class UI{
    public void hello(){
        System.out.println("""
                    ------------------------------------------------------------
                    Введите кнопку действия:
                       1 - если хотите выйти из программы
                       2 - если хотите перейти к калькулятору
                    ------------------------------------------------------------
                    """);       //Пользователь выбирает нужный пункт
    }
    public void wrongHello(){
        System.out.println("""
                ------------------------------------------------------------
                Нажмите 1 ИЛИ 2
                ------------------------------------------------------------
                 """);
    }
    public void choseOperator(){
        System.out.println("""
                ------------------------------------------------------------
                Какой оператор вы хотите использовать? (+, -, *, /)
                Если хотите остановить программу, напишите exit
                ------------------------------------------------------------
                            """);
    }
    public void wrongNumberFormat(){
        System.out.println("Ошибка: введен не правильный формат числа");
    }
}